app/Controllers/Mahasiswa.php

INSERT INTO `mahasiswa` (`nama`, `npm`, `email`, `jurusan`, `status`, `gambar`) VALUES ('sanji-kun', '2000928392', 'sanji@gmail.co.id', 'Perikanan', 'Mahasiswa Cuti', 'default.png')
---
      $profil->move('images', $namaPp);
    }

    $this->MahasiswaModel->save([
      'id' => $id,
      'nama' => $this->request->getVar('nama'),
      'npm' => $this->request->getVar('npm'),
      'email' => $this->request->getVar('email'),
      'jurusan' => $this->request->getVar('jurusan'),
      'status' => $this->request->getVar('status'),
      'gambar' => $namaPp,
    ]);