app/Models/MahasiswaModel.php

  public function tambahData($data)
  {
    $this->insert([
      'nama' => htmlspecialchars($data['nama']),
      'npm' => htmlspecialchars($data['npm']),
      'email' => htmlspecialchars($data['email']),
      'jurusan' => htmlspecialchars($data['jurusan']),
      'status' => 'Mahasiswa Aktif',
      'gambar' => 'default.png',
    ]);
---
INSERT INTO `mahasiswa` (`nama`, `npm`, `email`, `jurusan`, `status`, `gambar`) VALUES ('Jhon Smith', '123747348384', 'jhonsmith@gmail.co.id', 'Kesehatan Masyarakat', 'Mahasiswa Aktif', 'default.png')