app/Models/MahasiswaModel.php

  public function getMahasiswa($id = false)
  {
    if($id == false) {
      return $this->findAll();
    }

    return $this->where(["id" => $id])->first();
---
SELECT *
FROM `mahasiswa`
SELECT *
FROM `mahasiswa`
WHERE `id` = '36'
 LIMIT 1